## Staging: eks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 8 to add, 3 to change, 7 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                                  NAME                                                   |
|----------|---------------------------------------------------------------------------------------------------------|
| delete   | `aws_route53_record.notification-canada-ca-alt[&quot;*.api.staging.notification.alpha.cdssandbox.xyz&quot;]`      |
|          | `aws_route53_record.notification-canada-ca-alt[&quot;*.document.staging.notification.alpha.cdssandbox.xyz&quot;]` |
|          | `aws_route53_record.notification-canada-ca-alt[&quot;*.staging.notification.alpha.cdssandbox.xyz&quot;]`          |
|          | `aws_route53_record.notification-canada-ca-alt[&quot;api.staging.notification.alpha.cdssandbox.xyz&quot;]`        |
|          | `aws_route53_record.notification-canada-ca-alt[&quot;staging.notification.alpha.cdssandbox.xyz&quot;]`            |
| update   | `aws_lb_listener_rule.alt-domain-document-api-host-route[0]`                                            |
|          | `aws_lb_listener_rule.alt-domain-document-host-route[0]`                                                |
|          | `aws_lb_listener_rule.alt-domain-host-route[0]`                                                         |
| recreate | `aws_acm_certificate.notification-canada-ca-alt[0]`                                                     |
|          | `aws_lb_listener_certificate.alt_domain_certificate`                                                    |
| add      | `aws_acm_certificate_validation.notification-canada-ca-alt`                                             |
|          | `aws_route53_record.notification-canada-ca-alt[&quot;*.api.staging.alpha.notification.cdssandbox.xyz&quot;]`      |
|          | `aws_route53_record.notification-canada-ca-alt[&quot;*.document.staging.alpha.notification.cdssandbox.xyz&quot;]` |
|          | `aws_route53_record.notification-canada-ca-alt[&quot;*.staging.alpha.notification.cdssandbox.xyz&quot;]`          |
|          | `aws_route53_record.notification-canada-ca-alt[&quot;api.staging.alpha.notification.cdssandbox.xyz&quot;]`        |
|          | `aws_route53_record.notification-canada-ca-alt[&quot;staging.alpha.notification.cdssandbox.xyz&quot;]`            |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_acm_certificate.notification-canada-ca-alt[0] must be replaced
+/- resource "aws_acm_certificate" "notification-canada-ca-alt" {
      ~ arn                       = "arn:aws:acm:ca-central-1:239043911459:certificate/317e3889-3b13-4c28-b360-7f5c7d54d2b8" -> (known after apply)
      ~ domain_name               = "staging.notification.alpha.cdssandbox.xyz" -> "staging.alpha.notification.cdssandbox.xyz" # forces replacement
      ~ domain_validation_options = [
          - {
              - domain_name           = "*.api.staging.notification.alpha.cdssandbox.xyz"
              - resource_record_name  = "_e74f939be5cfcfc2fc308bb85c925ed8.api.staging.notification.alpha.cdssandbox.xyz."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_6c5f1e054573eb4eeaef2eb212fafac8.gbycpywhzv.acm-validations.aws."
            },
          - {
              - domain_name           = "*.document.staging.notification.alpha.cdssandbox.xyz"
              - resource_record_name  = "_0b470ab7b948ce2073da749061c99afa.document.staging.notification.alpha.cdssandbox.xyz."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_3b9faf7a03aadc824ded19cf529bf3dd.gbycpywhzv.acm-validations.aws."
            },
          - {
              - domain_name           = "*.staging.notification.alpha.cdssandbox.xyz"
              - resource_record_name  = "_61506a51477cc0c185214e1e236c1ebd.staging.notification.alpha.cdssandbox.xyz."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_b64b3e23bcbf064b6575422707914bbd.gbycpywhzv.acm-validations.aws."
            },
          - {
              - domain_name           = "api.staging.notification.alpha.cdssandbox.xyz"
              - resource_record_name  = "_e74f939be5cfcfc2fc308bb85c925ed8.api.staging.notification.alpha.cdssandbox.xyz."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_6c5f1e054573eb4eeaef2eb212fafac8.gbycpywhzv.acm-validations.aws."
            },
          - {
              - domain_name           = "staging.notification.alpha.cdssandbox.xyz"
              - resource_record_name  = "_61506a51477cc0c185214e1e236c1ebd.staging.notification.alpha.cdssandbox.xyz."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_b64b3e23bcbf064b6575422707914bbd.gbycpywhzv.acm-validations.aws."
            },
            # (5 unchanged elements hidden)
        ]
      ~ id                        = "arn:aws:acm:ca-central-1:239043911459:certificate/317e3889-3b13-4c28-b360-7f5c7d54d2b8" -> (known after apply)
      ~ key_algorithm             = "RSA_2048" -> (known after apply)
      ~ not_after                 = "2023-11-03T23:59:59Z" -> (known after apply)
      ~ not_before                = "2023-02-21T00:00:00Z" -> (known after apply)
      ~ pending_renewal           = false -> (known after apply)
      ~ renewal_eligibility       = "ELIGIBLE" -> (known after apply)
      ~ renewal_summary           = [] -> (known after apply)
      ~ status                    = "ISSUED" -> (known after apply)
      ~ subject_alternative_names = [ # forces replacement
          + "*.api.staging.alpha.notification.cdssandbox.xyz",
          - "*.api.staging.notification.alpha.cdssandbox.xyz",
          + "*.document.staging.alpha.notification.cdssandbox.xyz",
          - "*.document.staging.notification.alpha.cdssandbox.xyz",
          + "*.staging.alpha.notification.cdssandbox.xyz",
          - "*.staging.notification.alpha.cdssandbox.xyz",
          + "api.staging.alpha.notification.cdssandbox.xyz",
          - "api.staging.notification.alpha.cdssandbox.xyz",
          + "staging.alpha.notification.cdssandbox.xyz",
          - "staging.notification.alpha.cdssandbox.xyz",
        ]
        tags                      = {
            "CostCenter" = "notification-canada-ca-staging"
        }
      ~ type                      = "AMAZON_ISSUED" -> (known after apply)
      ~ validation_emails         = [] -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ options {
          ~ certificate_transparency_logging_preference = "ENABLED" -> (known after apply)
        }
    }

  # aws_acm_certificate_validation.notification-canada-ca-alt will be created
  + resource "aws_acm_certificate_validation" "notification-canada-ca-alt" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_lb_listener_certificate.alt_domain_certificate must be replaced
-/+ resource "aws_lb_listener_certificate" "alt_domain_certificate" {
      ~ certificate_arn = "arn:aws:acm:ca-central-1:239043911459:certificate/317e3889-3b13-4c28-b360-7f5c7d54d2b8" -> (known after apply) # forces replacement
      ~ id              = "arn:aws:elasticloadbalancing:ca-central-1:239043911459:listener/app/notification-staging-alb/81d71deedddc8281/ba77ef4a4a4c2e7c_arn:aws:acm:ca-central-1:239043911459:certificate/317e3889-3b13-4c28-b360-7f5c7d54d2b8" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_lb_listener_rule.alt-domain-document-api-host-route[0] will be updated in-place
  ~ resource "aws_lb_listener_rule" "alt-domain-document-api-host-route" {
        id           = "arn:aws:elasticloadbalancing:ca-central-1:239043911459:listener-rule/app/notification-staging-alb/81d71deedddc8281/ba77ef4a4a4c2e7c/9e1f68b34163d02e"
        tags         = {}
        # (4 unchanged attributes hidden)


      + condition {
          + host_header {
              + values = [
                  + "api.document.staging.alpha.notification.cdssandbox.xyz",
                ]
            }
        }
      - condition {
          - host_header {
              - values = [
                  - "api.document.staging.notification.alpha.cdssandbox.xyz",
                ] -> null
            }
        }
        # (1 unchanged block hidden)
    }

  # aws_lb_listener_rule.alt-domain-document-host-route[0] will be updated in-place
  ~ resource "aws_lb_listener_rule" "alt-domain-document-host-route" {
        id           = "arn:aws:elasticloadbalancing:ca-central-1:239043911459:listener-rule/app/notification-staging-alb/81d71deedddc8281/ba77ef4a4a4c2e7c/1ae5ae6149644ca5"
        tags         = {}
        # (4 unchanged attributes hidden)


      + condition {
          + host_header {
              + values = [
                  + "document.staging.alpha.notification.cdssandbox.xyz",
                ]
            }
        }
      - condition {
          - host_header {
              - values = [
                  - "document.staging.notification.alpha.cdssandbox.xyz",
                ] -> null
            }
        }
        # (1 unchanged block hidden)
    }

  # aws_lb_listener_rule.alt-domain-host-route[0] will be updated in-place
  ~ resource "aws_lb_listener_rule" "alt-domain-host-route" {
        id           = "arn:aws:elasticloadbalancing:ca-central-1:239043911459:listener-rule/app/notification-staging-alb/81d71deedddc8281/ba77ef4a4a4c2e7c/2140f85f11f30e66"
        tags         = {}
        # (4 unchanged attributes hidden)


      + condition {
          + host_header {
              + values = [
                  + "staging.alpha.notification.cdssandbox.xyz",
                ]
            }
        }
      - condition {
          - host_header {
              - values = [
                  - "staging.notification.alpha.cdssandbox.xyz",
                ] -> null
            }
        }
        # (1 unchanged block hidden)
    }

  # aws_route53_record.notification-canada-ca-alt["*.api.staging.alpha.notification.cdssandbox.xyz"] will be created
  + resource "aws_route53_record" "notification-canada-ca-alt" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.notification-canada-ca-alt["*.api.staging.notification.alpha.cdssandbox.xyz"] will be destroyed
  # (because key ["*.api.staging.notification.alpha.cdssandbox.xyz"] is not in for_each map)
  - resource "aws_route53_record" "notification-canada-ca-alt" {
      - allow_overwrite                  = true -> null
      - fqdn                             = "_e74f939be5cfcfc2fc308bb85c925ed8.api.staging.notification.alpha.cdssandbox.xyz.notification.cdssandbox.xyz" -> null
      - id                               = "Z04028033PLSHVOO9ZJ1Z__e74f939be5cfcfc2fc308bb85c925ed8.api.staging.notification.alpha.cdssandbox.xyz._CNAME" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "_e74f939be5cfcfc2fc308bb85c925ed8.api.staging.notification.alpha.cdssandbox.xyz" -> null
      - records                          = [
          - "_6c5f1e054573eb4eeaef2eb212fafac8.gbycpywhzv.acm-validations.aws.",
        ] -> null
      - ttl                              = 60 -> null
      - type                             = "CNAME" -> null
      - zone_id                          = "/hostedzone/Z04028033PLSHVOO9ZJ1Z" -> null
    }

  # aws_route53_record.notification-canada-ca-alt["*.document.staging.alpha.notification.cdssandbox.xyz"] will be created
  + resource "aws_route53_record" "notification-canada-ca-alt" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.notification-canada-ca-alt["*.document.staging.notification.alpha.cdssandbox.xyz"] will be destroyed
  # (because key ["*.document.staging.notification.alpha.cdssandbox.xyz"] is not in for_each map)
  - resource "aws_route53_record" "notification-canada-ca-alt" {
      - allow_overwrite                  = true -> null
      - fqdn                             = "_0b470ab7b948ce2073da749061c99afa.document.staging.notification.alpha.cdssandbox.xyz.notification.cdssandbox.xyz" -> null
      - id                               = "Z04028033PLSHVOO9ZJ1Z__0b470ab7b948ce2073da749061c99afa.document.staging.notification.alpha.cdssandbox.xyz._CNAME" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "_0b470ab7b948ce2073da749061c99afa.document.staging.notification.alpha.cdssandbox.xyz" -> null
      - records                          = [
          - "_3b9faf7a03aadc824ded19cf529bf3dd.gbycpywhzv.acm-validations.aws.",
        ] -> null
      - ttl                              = 60 -> null
      - type                             = "CNAME" -> null
      - zone_id                          = "/hostedzone/Z04028033PLSHVOO9ZJ1Z" -> null
    }

  # aws_route53_record.notification-canada-ca-alt["*.staging.alpha.notification.cdssandbox.xyz"] will be created
  + resource "aws_route53_record" "notification-canada-ca-alt" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.notification-canada-ca-alt["*.staging.notification.alpha.cdssandbox.xyz"] will be destroyed
  # (because key ["*.staging.notification.alpha.cdssandbox.xyz"] is not in for_each map)
  - resource "aws_route53_record" "notification-canada-ca-alt" {
      - allow_overwrite                  = true -> null
      - fqdn                             = "_61506a51477cc0c185214e1e236c1ebd.staging.notification.alpha.cdssandbox.xyz.notification.cdssandbox.xyz" -> null
      - id                               = "Z04028033PLSHVOO9ZJ1Z__61506a51477cc0c185214e1e236c1ebd.staging.notification.alpha.cdssandbox.xyz._CNAME" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "_61506a51477cc0c185214e1e236c1ebd.staging.notification.alpha.cdssandbox.xyz" -> null
      - records                          = [
          - "_b64b3e23bcbf064b6575422707914bbd.gbycpywhzv.acm-validations.aws.",
        ] -> null
      - ttl                              = 60 -> null
      - type                             = "CNAME" -> null
      - zone_id                          = "/hostedzone/Z04028033PLSHVOO9ZJ1Z" -> null
    }

  # aws_route53_record.notification-canada-ca-alt["api.staging.alpha.notification.cdssandbox.xyz"] will be created
  + resource "aws_route53_record" "notification-canada-ca-alt" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.notification-canada-ca-alt["api.staging.notification.alpha.cdssandbox.xyz"] will be destroyed
  # (because key ["api.staging.notification.alpha.cdssandbox.xyz"] is not in for_each map)
  - resource "aws_route53_record" "notification-canada-ca-alt" {
      - allow_overwrite                  = true -> null
      - fqdn                             = "_e74f939be5cfcfc2fc308bb85c925ed8.api.staging.notification.alpha.cdssandbox.xyz.notification.cdssandbox.xyz" -> null
      - id                               = "Z04028033PLSHVOO9ZJ1Z__e74f939be5cfcfc2fc308bb85c925ed8.api.staging.notification.alpha.cdssandbox.xyz._CNAME" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "_e74f939be5cfcfc2fc308bb85c925ed8.api.staging.notification.alpha.cdssandbox.xyz" -> null
      - records                          = [
          - "_6c5f1e054573eb4eeaef2eb212fafac8.gbycpywhzv.acm-validations.aws.",
        ] -> null
      - ttl                              = 60 -> null
      - type                             = "CNAME" -> null
      - zone_id                          = "/hostedzone/Z04028033PLSHVOO9ZJ1Z" -> null
    }

  # aws_route53_record.notification-canada-ca-alt["staging.alpha.notification.cdssandbox.xyz"] will be created
  + resource "aws_route53_record" "notification-canada-ca-alt" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.notification-canada-ca-alt["staging.notification.alpha.cdssandbox.xyz"] will be destroyed
  # (because key ["staging.notification.alpha.cdssandbox.xyz"] is not in for_each map)
  - resource "aws_route53_record" "notification-canada-ca-alt" {
      - allow_overwrite                  = true -> null
      - fqdn                             = "_61506a51477cc0c185214e1e236c1ebd.staging.notification.alpha.cdssandbox.xyz.notification.cdssandbox.xyz" -> null
      - id                               = "Z04028033PLSHVOO9ZJ1Z__61506a51477cc0c185214e1e236c1ebd.staging.notification.alpha.cdssandbox.xyz._CNAME" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "_61506a51477cc0c185214e1e236c1ebd.staging.notification.alpha.cdssandbox.xyz" -> null
      - records                          = [
          - "_b64b3e23bcbf064b6575422707914bbd.gbycpywhzv.acm-validations.aws.",
        ] -> null
      - ttl                              = 60 -> null
      - type                             = "CNAME" -> null
      - zone_id                          = "/hostedzone/Z04028033PLSHVOO9ZJ1Z" -> null
    }

Plan: 8 to add, 3 to change, 7 to destroy.

Changes to Outputs:
  ~ aws_acm_alt_notification_canada_ca_arn = "arn:aws:acm:ca-central-1:239043911459:certificate/317e3889-3b13-4c28-b360-7f5c7d54d2b8" -> (known after apply)

Warning: Argument is deprecated

  with aws_wafv2_web_acl.notification-canada-ca,
  on waf.tf line 1, in resource "aws_wafv2_web_acl" "notification-canada-ca":
   1: resource "aws_wafv2_web_acl" "notification-canada-ca" {

Use rule_action_override instead

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca-alt[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-documentation"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-application-logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-cluster-logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-cpu-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-memory-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-replicas-unavailable"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-pods-high-cpu-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-pods-high-memory-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-replicas-unavailable"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.celery-beat-replicas-unavailable"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.celery-pods-high-cpu-warning"]
WARN -...
```

</details>
